{"id": "home86_multi_329", "input": "Set the humidifier intensity to 90 in the guest bedroom, decrease the brightness of the light in the balcony by 43 percent, decrease the brightness of the light in the master bedroom by 45 percent, adjust the dehumidifier intensity to 70 in the dining room, raise the air conditioner temperature in the master bedroom by 1 degree, increase the curtain degree by 20 percent in the living room, set the heating temperature to 29 in the study room, and turn off the light in the study room.", "output": "'''error_input,balcony.light.set_brightness(40),master_bedroom.light.set_brightness(20),error_input,error_input,living_room.curtain.set_degree(20),error_input,study_room.light.turn_off(),'''", "home_id": 86, "type": "multi8_mix"}
{"id": "home69_one_1165", "input": "Set the intensity of the aromatherapy in the foyer to 50.", "output": "'''error_input'''", "home_id": 69, "type": "unexist_device"}
{"id": "home27_one_366", "input": "Set the intensity of the aromatherapy device to 80 on the balcony.", "output": "''' balcony.aromatherapy.set_intensity(80)'''", "home_id": 27, "type": "normal"}
{"id": "home28_one_1013", "input": "Close the curtains in the living room.", "output": "'''error_input'''", "home_id": 28, "type": "unexist_device"}
{"id": "home83_one_80", "input": "Set the intensity of the dehumidifier to 50 in the master bedroom.", "output": "''' master_bedroom.dehumidifiers.set_intensity(50)'''", "home_id": 83, "type": "normal"}
{"id": "home72_one_616", "input": "Set the fan speed of the heating system to high in the master bedroom.", "output": "'''error_input'''", "home_id": 72, "type": "unexist_attribute"}
{"id": "home65_one_1301", "input": "Set the heating temperature in the bathroom to 21 degrees.", "output": "'''error_input'''", "home_id": 65, "type": "unexist_device"}
{"id": "home88_multi_271", "input": "Open the blinds in the dining room, increase the intensity of the humidifier in the study room by 40 percent, set the intensity of the aromatherapy in the balcony to 70, adjust the dehumidifiers intensity to 20 in the master bedroom, set the brightness of the light to 70 in the master bedroom, set the air conditioner temperature to 24 in the guest bedroom, and set the air conditioner temperature to 30 in the living room.", "output": "'''error_input,error_input,error_input,error_input,master_bedroom.light.set_brightness(70),guest_bedroom.air_conditioner.set_temperature(24),error_input,'''", "home_id": 88, "type": "multi7_mix"}